const keyboard = {
    en: {
        top: ['q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p', '[', ']'],
        middle: ['a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', ';', '\''],
        bottom: ['z', 'x', 'c', 'v', 'b', 'n', 'm', ',', '.', '/'],
        space: [' ']
    },
    ru: {
        top: ['й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ'],
        middle: ['ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э'],
        bottom: ['я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю', '.'],
        space: [' ']
    },
    ua: {
        top: ['й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ї'],
        middle: ['ф', 'і', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'є'],
        bottom: ['я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю', '.'],
        space: [' ']
    }
}

export default keyboard;